src/Catalogs/СостоянияСтрокДокументов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Catalog>
		<Properties>
			<Name>СостоянияСтрокДокументов</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидОтказа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыОтказов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидСостояния</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыСостоянийСтрокДокументов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользуетсяВЗаказах</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользуетсяВЗаказахПоУмолчанию</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользуетсяВЗаявках</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользуетсяВЗаявкахПоУмолчанию</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользуетсяВПоступлениях</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользуетсяВПоступленияхПоУмолчанию</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользуетсяВРеализациях</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользуетсяВРеализацияхПоУмолчанию</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодДляСайта</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоступенПользователю</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеДляСайта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Catalogs/СостоянияСтрокДокументов/Ext/ObjectModule.bsl
Перем мЗарегистрироватьИзмененияДляСайта;

Процедура ПередУдалением(Отказ)
	
	Если РегистрыСведений.НастройкиПодсистем.ЗначениеПараметра("Обмен 1С-Сайт", "Справочник: СостоянияСтрокДокументов", Ложь) Тогда
		ОбменДаннымиКлиентСервер.ЗарегистрироватьОбъект(ЭтотОбъект, ПланыОбмена.ОбменПартКом83_Сайт.ПолучитьМетаданные());
	КонецЕсли
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	Если РегистрыСведений.НастройкиПодсистем.ЗначениеПараметра("Обмен 1С-Сайт", "Справочник: СостоянияСтрокДокументов", Ложь) И НЕ ЭтоГруппа Тогда
		мЗарегистрироватьИзмененияДляСайта = ОбменДаннымиКлиентСервер.НеобходимаРегистрацияИзменений(Метаданные.ПланыОбмена.ОбменПартКом83_Сайт, ЭтотОбъект);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если мЗарегистрироватьИзмененияДляСайта тогда
		ОбменДаннымиКлиентСервер.ЗарегистрироватьОбъект(ЭтотОбъект, Метаданные.ПланыОбмена.ОбменПартКом83_Сайт);
	КонецЕсли;
	
	Если НЕ ЭтоГруппа Тогда
		Если ИспользуетсяВЗаказахПоУмолчанию Тогда
			ПроверитьИспользованиеПризнака(Ссылка, "ИспользуетсяВЗаказахПоУмолчанию", Отказ);
		КонецЕсли;
		
		Если ИспользуетсяВЗаявкахПоУмолчанию Тогда
			ПроверитьИспользованиеПризнака(Ссылка, "ИспользуетсяВЗаявкахПоУмолчанию", Отказ);
		КонецЕсли;
		
		Если ИспользуетсяВРеализацияхПоУмолчанию Тогда
			ПроверитьИспользованиеПризнака(Ссылка, "ИспользуетсяВРеализацияхПоУмолчанию", Отказ);
		КонецЕсли;
		
		Если ИспользуетсяВПоступленияхПоУмолчанию Тогда
			ПроверитьИспользованиеПризнака(Ссылка, "ИспользуетсяВПоступленияхПоУмолчанию", Отказ);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПроверитьИспользованиеПризнака(Ссылка, вхПризнак, Отказ)
	
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.Текст = "ВЫБРАТЬ
	|	СостоянияСтрокДокументов.Ссылка
	|ИЗ
	|	Справочник.СостоянияСтрокДокументов КАК СостоянияСтрокДокументов
	|ГДЕ
	|	СостоянияСтрокДокументов.Ссылка <> &Ссылка
	|	И СостоянияСтрокДокументов." + вхПризнак;
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		Объект = Выборка.Ссылка.ПолучитьОбъект();
		Объект[вхПризнак] = Ложь;
		Попытка
			Объект.Записать();
		Исключение
			Отказ = Истина;
			ВызватьИсключение "Не удалось записать элемент " + Объект;
		КонецПопытки;
		
	КонецЦикла;
	
КонецПроцедуры

мЗарегистрироватьИзмененияДляСайта = Ложь;
